[
  {
    "id": 4239,
    "brand": "Visit the REDTIGER Store",
    "model": "REDTIGER  Front Rear, 4K/2.5K Full HD era for Cars, Included 32GB Card, Built-in Wi-Fi GPS, 3.18” IPS Screen, Night Vision, 170°Wide Angle, WDR, 24H Parking Mode",
    "image": "https://m.media-amazon.com/images/I/41IK3vBCYyL._AC_.jpg",
    "price": {
      "amazon_uk": 129.99
    },
    "rating": 4.6,
    "reviewCount": 13756,
    "resolution": "4K",
    "features": [
      "[4K+1080P Dual Recording] The REDTIGER F7N Plus dashcam ​records video up to Ultra HD 4K(3840*2160P)+FHD 1080P resolutions with STARVIS Sensor, helps you read the key details like road signs, vehicle number plates etc. Besides, the front 170° and rear 140° wide-angle dash cameras ensure to reduce blind area, With excellent audio recording, provide more powerful proof if an accident happens and gives you peace of mind after you left your vehicle.",
      "[Built-in WiFi/Smart App Control] The dashboard camera can connect to your smartphone APP via built-in WiFi.Use the [REDTIGER] app to view, playback, and manage the dashcams on your IOS or Android devices. Furthermore, You can also download and edit videos in the app, and one-click sharing allows you to share your travel scenery and wonderful moments with your friends and family. Note: The effective distance of Wi-Fi is 3-5m, and remote connection is not supported.",
      "[Dash Camera with GPS] This car recording ​has a built-in GPS and records the driving route, real-time speed, location, etc., tracker on google maps via Wi-Fi using the App or with our Windows and Mac GPS Player, which will provide further additional evidence if an accident occurs.",
      "[Super Night Vision] The dash cam front and rear is equipped with a large F1.5 aperture 6-layer optical lens, equipped with HDR/WDR technology, which can automatically increase the exposure in dark situations, so as to achieve clear images in low-light environments. The car driving recorder can clearly display road details such as license plate numbers and road signs, and the unique design brings driving safety in the dark.",
      "[Reliable Features for Accident Recording] The full car dashboard camera has loop recording that allows continuous recording when the memory card is full; When G-sensor detects a sudden collision, it locks and saves the collision video; the 24H Parking monitor enables the dashcam to record continuously for 24 hours with Timelapse function at parking mode.",
      "[Super Capacitor &amp; Loop Recording] Super capacitor is powered instead of lithium batteries, which are built to survive extreme weather conditions from -4°F-158°F. Ensure it’s stable working anytime and gives a longer life span than battery power dashcam. Loop recording auto overwrite the oldest video when memory card is full. Make sure car camera can keep recording."
    ],
    "releaseDate": "2024-03-15",
    "popularity": 96,
    "amazonUrl": {
      "uk": "https://www.amazon.co.uk/REDTIGER-Recorder-G-Sensor-Recording-Capacitor-Black/dp/B098WVKF19?dib=eyJ2IjoiMSJ9.y40nKtSbRlHhzWAvtQ8Dtw9ZpK1WtqoKns-nBdrcMHPPQwVZ4xYYQRQWvhydZVqtmt_mtEAncsOsZSTz38fWvmzx_WI43v2VyWytYPw-gi_cjhhXIFluX6Nt6bN6ZhxstSa42FjtKyzQ546naTLrqAIKZwREtTBHSlPfrXcVyNbwvwEhIl32I_JCSAIBBVUMx-TXMlRIJpGj_-jAoz8wl8piAuz1b0oTjeB3-K_9-7c.XPxgjKbNIS8vIHIw340lu95dXZIeoGJw5gZLigIUhAc&dib_tag=se&keywords=REDTIGER+F7NP&qid=1742043753&sr=8-4"
    }
  },
  {
    "id": 4239,
    "brand": "Visit the REDTIGER Store",
    "model": "REDTIGER  Front Rear, 4K/2.5K Full HD era for Cars, Included 32GB Card, Built-in Wi-Fi GPS, 3.16” IPS Screen, Night Vision, 170°Wide Angle, WDR, 24H Parking Mode(F7NP)",
    "image": "https://m.media-amazon.com/images/I/41IK3vBCYyL._AC_.jpg",
    "price": {
      "amazon_com": 119.99
    },
    "rating": 4.4,
    "reviewCount": 14124,
    "resolution": "4K",
    "features": [
      "4K+1080P DUAL RECORDING- REDTIGER brings to you F7NP dual dash cam which records video of up to Ultra HD 4K(3840*2160P)+FHD 1080P resolutions. It helps you to read the key details like road signs and vehicle license plates.To reduce the blind areas it has the front wide angle of 170 degree and rear wide angle of 140 degree. This helps you during unexpected circumstances like collision to retain and present evidence.",
      "SUPERIOR NIGHT VISION- REDTIGER driving recorder adopts an excellent optical lens with an ultra-large F1.5 aperture and 6 layer glass, and is equipped with HDR/WDR technology to capture important details clearly under low light conditions.",
      "WiFi/SMART APP CONTROL- You just need to connect the dash cam to your smartphone APP via WiFi and then you can use the &#34;Redtiger&#34; app to view, playback, and manage the dash cam on your IOS or Android devices. You can also download and edit videos in the app. By just one-click you can share your travel experiences and wonderful moments with your friends and family.",
      "DASH CAM WITH GPS- REDTIGER dash cam has a built-in GPS and records the driving route, real-time speed, precise location data.You can track on google maps via WiFi using the App or with our Windows and Mac GPSPlayer, which will provide further additional evidence if an accident occurs.",
      "RELIABLE FEATURES FOR ACCIDENT RECORDING- Even when the card is full the REDTIGER dash cam will continue recording with its Loop Recording feature. As soon as the G sensor detects a sudden collision, it locks and saves the collision video. It also has a 24-hour parking monitor available on the dash cam to record continuously for 24 hours with time-lapse recording at parking mode. Please note that a hardware kit is needed.",
      "SUPER AFTERSALES-Our greatest pursuit is to satisfy the needs of consumers. REDTIGER dash cam is backed by full 18-MONTH Assurance and 100% Satisfaction Guarantee.Email our customer service and we will assist you with any questions or concerns. We also offer 7*24 hours technical support."
    ],
    "releaseDate": "2024-03-15",
    "popularity": 94,
    "amazonUrl": {
      "com": "https://www.amazon.com/REDTIGER-Camera-Included-170%C2%B0Wide-Parking/dp/B098WVKF19?crid=34NPEKYH2ZLUN&dib=eyJ2IjoiMSJ9.bJfIa99xDAJ1uLaHV0bnuExy-NgwMMZC3y6jv-SdA7etHmGXtDbnF56aj1mAuPuM-WDbWwHjGeI9euXogwkEDxZMtGDxhwFSfj5X6Ki2Pqo3u-sGdHutjPI2imwjP6--SIo0ANW7fAmi6-oUem6l_JwSLW5CRMQYeixdY_1cSj_7XICTci2U2yPXodCkYmIRKTo3PeDl836nFuDWJ-tzuanrS_6yA6swfmqGcc1EugU.2ydXndrkl49PvjME5-gev50QVCMxIya9kkRmpFn5KrA&dib_tag=se&keywords=REDTIGER+F7NP&qid=1742043826&sprefix=redtiger+f7np%2Caps%2C994&sr=8-3"
    }
  },
  {
    "id": 5842,
    "brand": "Visit the ROVE Store",
    "model": "ROVE R2-4K DUAL  Front and Rear, STARVIS 2 Sensor, FREE 128GB Card Included, 5G WiFi - up to 20MB/s Fastest Download Speed with App, 4K 2160P/FHD era for Cars, 3&#34; IPS, 24H Parking Mode",
    "image": "https://m.media-amazon.com/images/I/51SmyQooLuL._AC_.jpg",
    "price": {
      "amazon_com": 119.99
    },
    "rating": 4.4,
    "reviewCount": 2178,
    "resolution": "4K",
    "features": [
      "4K FRONT + 1080P REAR RECORDING – ROVE R2-4K DUAL dash cam offers dual-channel recording capabilities, capturing footage simultaneously from both the front and rear cameras. The front camera records at 3840x2160P @30fps, while the rear camera captures 1920x1080P @30fps footage, ensuring clear recordings of the road ahead and behind you. With a 150° ultra-wide angle for the front camera and a 140° angle for the rear camera, you&#39;ll capture more of the road with this 4k dash cam.",
      "SONY STARVIS 2 SENSOR/SUPER NIGHT VISION – Equipped with a Sony STARVIS 2 Image Sensor for the front camera, this dash cam delivers exceptional image quality with vivid colors and sharp details, even in challenging lighting conditions. Additionally, the front camera&#39;s F1.5 aperture and the rear camera&#39;s F1.8 aperture allow more light to enter the lens, resulting in brighter and clearer recordings, particularly in low-light environments.",
      "ULTRA FAST 5G WIFI/ UP TO 20MB/s DOWNLOAD SPEED – With its built-in dual-band 5GHz and 2.4GHz WiFi, you can use the ROVE dash cam app to view and manage dash cam recordings instantly on your iOS and Android devices. By using the ROVE app - download your recorded 4K videos directly to your smartphone at a speed of up to 20 MB/sec and then easily share these on social media with friends and family. Additionally, manage camera settings and update the latest firmware over-the-air via the ROVE App.",
      "CAR CAMERA WITH GPS – The new front and rear dashcam comes with built-in GPS which enables you to view real-time live speed and compass on the 3” IPS wide camera screen. It records precise driving routes, locations, and speed stamps directly on the video so you can watch dashcam videos with GPS data using ROVE&#39;s free GPS Player on your PC or Mac &amp; get additional evidence when you need it.",
      "FEATURES WITH STATE-OF-THE-ART TECHNOLOGY INCLUDED – Experience peace of mind with this front and rear car dash cam. It comes with a free 128GB microSD card and offers advanced features such as an f1.5 aperture, motion detection, G-sensor, seamless loop recording, emergency video lock, screen saver, live speed and compass direction, voice guidance, ring of threads for optional CPL filter, a built-in supercapacitor for extended product life, support for up to 1TB microSD cards, and many more.",
      "Our 24/7 CUSTOM DESIGNED PARKING MODE – R2-4K DUAL offers three options for its custom-designed 24hr parking mode with voice guidance. 1fps timelapse video, motion detection, and collision detection. A hardwire kit is required (buy separately, ASIN: B0B7235VLX). If an event occurs in the park, then the camera will record a full 1-min video, lock it safely in an event folder, and give you a voice alert the next time you start your car letting you know that event has occurred while you were away."
    ],
    "releaseDate": "2024-03-15",
    "popularity": 55,
    "amazonUrl": {
      "com": "https://www.amazon.com/ROVE-R2-4K-DUAL-STARVIS-Included/dp/B0D6J5B98H?crid=2S8600HGGU00I&dib=eyJ2IjoiMSJ9.fbmQrFB_4WbWWTQMJgk8MUHFl4DGZpLNeZeI70alOGKX8H0IJgMa1DrwcDoXBNHRr-IPDnT4Ev-F3KKvLtTwrIkfQ3DRBv9vL_-rxI2G-f8g5bNeayJn85KkRF-RHRqaHT-vlcBTkqwLM-J4lXm5rV0hNdUvGrG6_lhRJhoU84CriJqSCNSbuV2Pqyj-S392oWGqKum3VQzBQTIJr9RiJVww7Xn6mXAoGo4iv5s-Q_I.JtmqixVNJX1aEDEBWn1sDgUO6R4EfeyJvcFl8NkYUgI&dib_tag=se&keywords=rove+r2&qid=1742043872&sprefix=rove+r2%2Caps%2C378&sr=8-3"
    }
  },
  {
    "id": 381,
    "brand": "Visit the ARIFAYZ Store",
    "model": "Front and Rear 4K+1080P, Free 64GB Card, Built-in WiFi, era for Cars, , Dual s for Cars with Night Vision, 24 Hours Parking Monitor, Loop Recording",
    "image": "https://m.media-amazon.com/images/I/41kQ6r03ocL._AC_.jpg",
    "price": {
      "amazon_com": 59.99
    },
    "rating": 4.3,
    "reviewCount": 2022,
    "resolution": "4K",
    "features": [
      "💖💖【New Updated Features Since 17 Aug 2024】This front and rear dash cam has been upgraded to 4K+1080P from its previous 2K+1080P resolution since 17 Aug 2024. Get ready for an ultra-high-definition driving experience that ensures your safety on the road.",
      "【4K+1080P Front and Rear Dual Dash Cam】The Q4 dashcam front and rear camera simultaneously record the road front (160°) and rear (150°) in sharp detail at 4K 2160P front and 1080P rear resolution, which ensures every angle is covered and nothing is missed.",
      "【4K Ultra HD 2160P Car Camera】Q4 dash cam records UHD 3840*2160P/30fps video, capturing precise details of license plates and road signs day and night. With cutting-edge GC CMOS+160° wide angle+6G lens, it vividly captures driving moments, providing detailed evidence.",
      "【Built-in 2.4G WiFi &amp; APP Control】This Q4 dashcam comes with APP for Android or iOS smartphones to get a live stream, download videos, change settings, edit and share your footage simple. Films can be shared to YouTube, Twitter, Facebook, or the social media platform according to your preference and with the tap of a finger, allowing you to share bits and pieces of any journey with all of your friends.",
      "【Compact and Super Easy to Install】With mini and pocket-sized design (Size: 3.7x1.8x1.4in), the hidden camera is mounted behind the rear view mirror and goes virtually unnoticed, which won&#39;t obstruct your vision while driving. Uncomplicated installation and operation, no need to worry even for a first time user.",
      "【24 Hours Parking Mode】Requires Type C hardwire kit (ASIN: B0BFQWY1H8, not included). This 4K dashcam automatically switches to parking mode when your car is parked. It detects collisions via impact or movement. The time lapse recording mode maintains continuous recording with minimal power consumption and a low frame rate. It supplies continuous protection, triggering recording if your parked vehicle experiences a collision or attempted theft, ensuring around-the-clock security."
    ],
    "releaseDate": "2024-03-15",
    "popularity": 53,
    "amazonUrl": {
      "com": "https://www.amazon.com/Dashcams-Parking-Monitor-Recording-Support/dp/B0BKF6XQVY?crid=3HMXQGMRY272G&dib=eyJ2IjoiMSJ9.OprHLJirSbRZ_UFHFwaT91S3YyxE7EGHbi612be7Nwf2ildLz52_jvZaPeUacQl5HNqMraL6u3Hav1n3vZDviDrUA2Cf7BhY2eNSLVsiQYcgKBh2xuopW3na2ErPzmWwWtrNvvTzkD2guVE7-QVdEaCCBocT9fkdaRQ6EfM9Zs9G5f1VUpT0v2JcPd-zZlc8b4j0dfGgf8bcvPMaJNujeY2HLvKuUqg9kKjTB95uJWE.-a3FoDmI6M2I9Yt4OlTYsDXH_6BRZqZKCzvbjJ26GDU&dib_tag=se&keywords=ARIFAYZ+Q4&qid=1742044121&sprefix=arifayz+q4%2Caps%2C430&sr=8-1"
    }
  },
  {
    "id": 358,
    "brand": "Visit the VIOFO Store",
    "model": "VIOFO A119 V3  Front Camera Only - G-sensor Motion Detection GPS HDR Enhanced Night Vision era - 140° Wide Angle, Compact 2.0&#39;&#39; LCD Screen In  for Cars",
    "image": "https://m.media-amazon.com/images/I/41Kh+dQqmPL._AC_.jpg",
    "price": {
      "amazon_uk": 109.99
    },
    "rating": 4,
    "reviewCount": 2333,
    "resolution": "720p",
    "features": [
      "HIGH QUALITY VIDEO FOR FRONT CAMERA: All VIOFO dashcams are designed to provide the best quality video recording and playback. Using a QHD 5MP IMX335 Sony starvis sensor and high quality 140° wide angle lens to ensure the best quality footage is recorded at 60 frames per second. Built in microphone &amp; motion detection. Never miss a number plate or incident again.",
      "COMPACT DIMENSIONS: Measuring just 5.3 x 4.8 x 8.3cm this VIOFO A119 V3 car dash cam is discreet but high quality. Securely attached directly to your windscreen &amp; out of your direct eye-line, unlike cheap dashcams for cars with adhesive mount that dry out or become detached meaning you can be confident this camera will be there if needed.",
      "GPS TRACKING INCLUDED: The A119 V3 dash camera uses secure GPS to store your real-time speed, G forces, the time &amp; your location. This data is displayed in the video file when played back which can be vital for Insurance claims or Police evidence. Combined with other useful features including auto event detection, auto start/ stop, parking mode, time lapse recording and more.",
      "SUPERIOR NIGHT VISION: 50% of UK road deaths happen at night. With this in mind the VIOFO A119 V3 in car dashcam has been developed to ensure it provides the clearest possible picture at night. This is thanks to our Sony 5MP sensor &amp; HDR software which can quickly adjust to bright &amp; dark areas which is vital when driving with other cars headlights at night.",
      "EASY TO FIT: All VIOFO Dash cameras are easy to attach to your vehicles windscreen with the integrated sticky pad. Using the supplied adaptor you do not need to remove your cars dashboard or interfere with its electrical system to fit this dash cam. Optional hardwire kit HK3 ACC hardwire cable (sold separately) is also available for a seamless installation."
    ],
    "releaseDate": "2024-03-15",
    "popularity": 52,
    "amazonUrl": {
      "uk": "https://www.amazon.co.uk/VIOFO-A119-Dash-Front-Camera-Black/dp/B07RXQLV5C"
    }
  },
  {
    "id": 2163,
    "brand": "Visit the GMAIPOP Store",
    "model": "Front and Rear,4K+1080P WiFi Dual era for Cars with App, 3&#34; IPS  Recorder,Night Vision,24H/7 Parking Mode, Loop Recording,170° Wide Angle,Free 64GB SD Card",
    "image": "https://m.media-amazon.com/images/I/41-l9HbE1zL._AC_.jpg",
    "price": {
      "amazon_com": 59.99
    },
    "rating": 4.4,
    "reviewCount": 1414,
    "resolution": "4K",
    "features": [
      "【Real 4K+1080P Dual Dash Cam 】Front cam - ultra 4K( 3840*2160P, 30 FPS),Rear/inside- FHD 1080P( 1920*1080P, 30 FPS),To reduce the blind areas,the front cam wide angle of 170 degree and rear cam wide angle of 160 degree. clearly capture the key details like road signs,vehicle plates...It provides the significant evidence for car accidents",
      "【WiFi &amp; Phone APP Control】The 4K dash cam front and rear support free APP for Android or iOS smartphones. Easily access record videos,watch live stream ,Setting camera,download and share your footage to social media by smartphone directly. Don&#39;t hesitate to share any recorded journey to your friends",
      "【Optional Inside/Rear Camera】You can install the small car dashcam on front windshield to record inside or install on rear windshield to monitor backside of your car. 2 methods installation for you to choose",
      "【Crystal Night Version With HDR】The 4K dash camera is equipped with advanced Sensor + 170°wide-angle + 6 Glass lens，the front and back dash cam will record crystal video at night. HDR function can cut down on glare and reflection",
      "【Accident lock &amp; 24/7 Parking monitor】1. G-sensor---lock the video as vital evidence when detects a bump happen even on road or during parking time， it won&#39;t be overwritten 2. Loop recording--- Overwrite the oldest videos with the latest video automatically when TF card is full 3. Recording7/24H /Time Lapse--- dash cam captures and records footage at 1 fps/3 fps per second to conserve memory, allowing for continuous surveillance of a parked vehicle.One Reliable witness anytime",
      "No Wireless dash cam --- . the dash cam need cables to plug in power and rear camera need wire to connect. We said wireless means WiFi app control from your smartphone to download videos"
    ],
    "releaseDate": "2024-03-15",
    "popularity": 51,
    "amazonUrl": {
      "com": "https://www.amazon.com/Camera-Dashboard-Recorder-Parking-Recording/dp/B0CC9G8G9Q?dib=eyJ2IjoiMSJ9.gU_4ddAohlhcjSh4pje7raFhsAmAkOHUdfY7FvemfqmcqnY-yAv8ofQhMTyAm3nPShtLt-FhImRmi-LOmEXbe0b0SqO2wj6fWfP_phR8LmwHkdCNxRIWv6pZVdCKHWGKUcPrVPjfZHwYHcAIPObetw.iNCJnW04aQxWfLs0XwkMvngLWE6Xh7s2W3hGjuN_5Hs&dib_tag=se&keywords=GMAIPOP+G900&qid=1742044066&sr=8-1"
    }
  },
  {
    "id": 1544,
    "brand": "Visit the VIOFO Store",
    "model": "VIOFO  A119 Mini 2, STARVIS 2 Sensor, 2K 60fps/HDR 30fps Voice Control Car era with 5GHz Wi-Fi GPS, Night Vision 2.0, 24H Parking Mode, Supercapacitor, Support 512GB Max",
    "image": "https://m.media-amazon.com/images/I/41qbn4waiEL._AC_.jpg",
    "price": {
      "amazon_com": 138.99
    },
    "rating": 4.3,
    "reviewCount": 1117,
    "resolution": "1440p",
    "features": [
      "【STARVIS 2 Mini Dash Cam】VIOFO dash cam A119 Mini 2 revolutionarily deploys newest STARVIS 2 IMX675 image sensor. This 2K mini dash cam can bring low noise, eliminate motion blur and shoot clearer details during day and night recording. A119 Mini 2 has a rather mini design, making it much easier to hide behind or next to the rear-view mirror. The concealed installation design won&#39;t obstruct your sight. (*[A119 Mini 2] is a 1-channel front dash cam. Don&#39;t have/not support a rear cam.)",
      "【Stunning 1440P 60fps Capture】VIOFO dash camera A119 Mini 2 supports 2K 2560x1440P@60fps, maximum 2.7K 2592x1944P@30fps resolution, clearly capturing essential details such as road signs and number plates in all lighting conditions. (* With HDR enabled, the frame rate will drop from 60fps to 30fps.) This dash cam front 140°wide angle provides a good field of view for recording everything that happens on the road. You can fully immerse yourself in your journey.",
      "【DOL-HDR Superb Night Vision 2.0】Night vision effect, especially the ability to clearly capture license plate numbers in low light, has been highly optimized in VIOFO on-dash camera A119 Mini 2. Combing STARVIS 2 IMX675 image sensor, a 7-Glass F1.6 large aperture lens with DOL-HDR tech, A119 Mini 2 can balance extremely bright and dark areas to help accurately restore 2K details recorded in situations such as nighttime roads or tunnels entrances/exits with large changes in brightness.",
      "【Faster 5GHz Wi-Fi &amp; GPS】VIOFO 2K dash cam A119 Mini 2 supports upgraded 5GHz Wi-Fi to provide 4 times faster file transfer. Connect the dashcam to your iOS &amp; Android phones via the VIOFO app and you can live view, playback, download videos, or adjust settings, making it simple to access, store, and send over video evidence in case of any incident. Built-in GPS module can automatically synchronize satellite time and record driving route, speed, and time data into the video files.",
      "【Smart Voice Control】By giving simple voice commands, VIOFO front dash cam A119 Mini 2 allows you to lock the video, take photos, turn on/off WiFi and more. It also comes with voice notifications to clearly inform you of settings changes or memory card errors. Just keep your hands on the wheel and keep your eyes fully focused on the road. Voice control &amp; notifications bring you driving safety as well as added convenience.",
      "【24/7 Buffered Parking Mode】The VIOFO dash camera for cars A119 Mini 2 offers three parking modes. Auto Event Detection - supported by a 15s pre-recording buffered function, it automatically records a 45s video that starts 15s before and 30s after the detected event. Low Bitrate Recording - keep recording continuously in mini file size with audio recorded. (* Please separately order the HK4 hardwire kit(Asin B09MRVP2PX) to use three parking modes.)"
    ],
    "releaseDate": "2024-03-15",
    "popularity": 49,
    "amazonUrl": {
      "com": "https://www.amazon.com/VIOFO-STARVIS-Control-Parking-Supercapacitor/dp/B0C5MVB7NX?crid=1PV1LJBU7THD9&dib=eyJ2IjoiMSJ9.gYfZw9JImHmo4H1GGP__xZxTYkWfmeG77as2zl9MUE8GrwZvIB8vFVg-q8VK0BW1uZ51rWRy5_T8GXte6c2dNUHJnMznrSbu1ELhuB4IbzIzhIAm8uhSRf2o4Kz7ncCkDnkx08Gv47Xgp6AEjvpBCbREKZPLPccRM3s8_aihSUV57GG5huFKRiBh63-O9HZgqPYk2MFuYRcrRwDpx2pVxxxq8yO4dhrT6YXlsN3VsOc.Pk-uwVZoaY-JIi5CELCoNU3RGV1LQDtN4Y1iOSctam4&dib_tag=se&keywords=VIOFO+A119+Mini&qid=1742043987&sprefix=viofo+a119+mini%2Caps%2C565&sr=8-1"
    }
  }
]